{
  "generated": "2025-12-28T15:00:03.416Z",
  "version": "1.0.0",
  "source": "airtable",
  "recordCount": 18,
  "faculty": [
    {
      "id": "rec0meucobcVjMYXW",
      "name": "Di Ann Sanchez",
      "firstName": "Di Ann",
      "title": "Human Resources Chief Exceptional Officer",
      "organization": "DAS HR Consulting & Sanchez Associates",
      "bio": "Dr. Di Ann Sanchez, SHRM-SCP, SPHR is a nationally recognized HR strategist and founder of DAS HR Consulting, LLC, a firm specializing in creative, non-traditional HR programs and diversity solutions. A leading expert on LatinX Millennials and Gen Z, she helps organizations align their people strategies with business growth, productivity, and performance.\n\nDAS HR Consulting offers expertise in workforce generational dynamics, pay equity, benefits analysis, diversity and compliance training, employee relations, leadership development, executive coaching, recruiting and retention strategies, succession planning, HR technology, and IDEA initiatives.\n\nDr. Sanchez is a sought-after speaker and advisor with deep experience across industries including airlines, manufacturing, defense, utilities, hospitality, healthcare, construction, and nonprofits. Her work empowers organizations to build inclusive, high-performing workplaces ready for the future.",
      "imageUrl": "https://storage.googleapis.com/msgsndr/MjGEy0pobNT9su2YJqFI/media/690667eb6947d88a87edcc70.svg",
      "bioLink": "www.iaml.com"
    },
    {
      "id": "rec4rKtRbnn56VCMj",
      "name": "Brenda Heinicke, Esq.",
      "firstName": "Brenda",
      "title": "Director, Global Employment Law",
      "organization": "Terumo Blood & Cell Technologies",
      "bio": "",
      "imageUrl": "https://storage.googleapis.com/msgsndr/MjGEy0pobNT9su2YJqFI/media/6911ef6e87254432cbd4b2fe.svg",
      "bioLink": "www.iaml.com"
    },
    {
      "id": "rec7eX5uXoWOg6wHc",
      "name": "George Cicotte, Esq.",
      "firstName": "George",
      "title": "Founder",
      "organization": "Cicotte Law Firm",
      "bio": "",
      "imageUrl": "",
      "bioLink": "www.iaml.com"
    },
    {
      "id": "rec7kuWXpBRWV8qvL",
      "name": "Dominic DeMatties, Esq.",
      "firstName": "Dominic",
      "title": "Partner",
      "organization": "Thompson Hine LLP",
      "bio": "Dominic is a leading employee benefits attorney with deep expertise in ESOPs, 401(k) and other defined contribution plans, MEPs/PEPs, multiemployer plans, and innovative defined benefit designs like cash balance and variable annuity plans. He frequently represents clients before the DOL, IRS, and PBGC on audits, investigations, compliance programs, and policy matters, and is a go-to advisor for plan design, risk-transfer transactions, and employee benefits issues in corporate deals.\n\nPrior to joining Thompson Hine, Dominic was a partner at an Am Law Global 100 firm and served as an attorney-advisor in the U.S. Treasury’s Office of Benefits Tax Counsel, where he helped shape national policy on ESOPs, hybrid pension plans, deferred compensation, and multiemployer plans. A sought-after speaker on ERISA and tax issues, Dominic combines insider regulatory experience with practical counsel to help clients navigate complex, high-stakes benefits matters.",
      "imageUrl": "https://storage.googleapis.com/msgsndr/MjGEy0pobNT9su2YJqFI/media/690667ebe98d66862dcb05f6.svg",
      "bioLink": "www.iaml.com"
    },
    {
      "id": "rec9Q9DHcy6dN2SnD",
      "name": "Wayne Williams, Esq.",
      "firstName": "Wayne",
      "title": "Founder",
      "organization": "Law Offices of Wayne Williams",
      "bio": "",
      "imageUrl": "https://storage.googleapis.com/msgsndr/MjGEy0pobNT9su2YJqFI/media/690667ebe98d66054ecb05fb.svg",
      "bioLink": "www.iaml.com"
    },
    {
      "id": "recBSj5kd0Z6KWGgU",
      "name": "Doug Hinson, Esq.",
      "firstName": "Doug",
      "title": "Senior Counsel",
      "organization": "Alston & Bird LLP",
      "bio": "",
      "imageUrl": "",
      "bioLink": "www.iaml.com"
    },
    {
      "id": "recCysOqbmx33qZGA",
      "name": "Dawn Kubik, Esq.",
      "firstName": "Dawn",
      "title": "Of Counsel",
      "organization": "Wymer Employment Law",
      "bio": "",
      "imageUrl": "https://storage.googleapis.com/msgsndr/MjGEy0pobNT9su2YJqFI/media/690667ebe98d665980cb05f7.svg",
      "bioLink": "www.iaml.com"
    },
    {
      "id": "recDOeTl32nzCbWxH",
      "name": "Patrick Scully, Esq.",
      "firstName": "Patrick",
      "title": "Partner",
      "organization": "Foley Hoag LLP",
      "bio": "",
      "imageUrl": "https://storage.googleapis.com/msgsndr/MjGEy0pobNT9su2YJqFI/media/690667eb6947d87c78edcc71.svg",
      "bioLink": "www.iaml.com"
    },
    {
      "id": "recE209WG3XRLBwqB",
      "name": "Jacqueline Kalk, Esq.",
      "firstName": "Jacqueline",
      "title": "Shareholder at Littler Mendelson P.C.",
      "organization": "Wymer Employment Law",
      "bio": "Jacqueline E. Kalk represents and advises management across industries including manufacturing, construction, crowd-sourcing, and virtual companies. She focuses on independent contractor classification, wage-and-hour compliance, equal pay, and employment litigation, defending clients in state and federal courts as well as before administrative agencies.\n\nJacqueline helps employers avoid litigation by designing compliant policies, conducting worker classification analyses, and delivering training programs on employment law and litigation prevention. A frequent national speaker and published author on employment law and wage-and-hour issues, she is known for translating complex legal concepts into practical, actionable guidance for HR professionals and business leaders.",
      "imageUrl": "https://storage.googleapis.com/msgsndr/MjGEy0pobNT9su2YJqFI/media/690e254f27678e7871e709c4.svg",
      "bioLink": "www.iaml.com"
    },
    {
      "id": "recMbHQtDKRCqBkvZ",
      "name": "John Hickman, Esq.",
      "firstName": "John",
      "title": "Partner",
      "organization": "Alston & Bird LLP",
      "bio": "",
      "imageUrl": "https://storage.googleapis.com/msgsndr/MjGEy0pobNT9su2YJqFI/media/690667eb6947d83db0edcc6b.svg",
      "bioLink": "www.iaml.com"
    },
    {
      "id": "recNZZAA7eSH4kub4",
      "name": "Rudi Turner, Esq.",
      "firstName": "Rudi",
      "title": "Senior Corporate Counsel",
      "organization": "White Cap",
      "bio": "Rudi is counsel in the firm’s Labor & Employment group, representing employers in a wide range of employment disputes in state and federal courts and before administrative agencies. She has deep experience defending claims of discrimination, harassment, retaliation, wrongful termination, and other labor code violations, as well as guiding clients through mediation, arbitration, and litigation.\n\nBeyond litigation, Rudi partners with employers to develop, implement, and audit workplace policies, offering practical strategies to reduce risk and ensure compliance. Known for her clear, solutions-focused counsel, she helps organizations navigate complex employment challenges with confidence.",
      "imageUrl": "https://storage.googleapis.com/msgsndr/MjGEy0pobNT9su2YJqFI/media/690e22920269a38b86c905cb.svg",
      "bioLink": "www.iaml.com"
    },
    {
      "id": "recSGAvUdF4678gA9",
      "name": "Amy Zdravecky, Esq.",
      "firstName": "Amy",
      "title": "Partner",
      "organization": "Barnes & Thornburg LLP",
      "bio": "",
      "imageUrl": "https://storage.googleapis.com/msgsndr/MjGEy0pobNT9su2YJqFI/media/690e22acc87c0f45146d61fd.svg",
      "bioLink": "www.iaml.com"
    },
    {
      "id": "recdn3uoqPDiICi9a",
      "name": "Grant Gibeau, Esq.",
      "firstName": "Grant",
      "title": "Partner",
      "organization": "Taft Stettinius & Hollister LLP",
      "bio": "Grant Gibeau defends employers against discrimination claims, wage-hour lawsuits, union challenges, and NLRB disputes. As a Taft partner in Minneapolis, he prevents workplace problems before they escalate and wins the battles that can't be avoided.",
      "imageUrl": "https://storage.googleapis.com/msgsndr/MjGEy0pobNT9su2YJqFI/media/690e229c43570019cba3b51f.svg",
      "bioLink": "www.iaml.com"
    },
    {
      "id": "rech00qD2rjunIoGX",
      "name": "John Wymer, Esq.",
      "firstName": "John",
      "title": "Partner",
      "organization": "Thompson Hine LLP",
      "bio": "",
      "imageUrl": "https://storage.googleapis.com/msgsndr/MjGEy0pobNT9su2YJqFI/media/690667ebba45f28666768ce6.svg",
      "bioLink": "www.iaml.com"
    },
    {
      "id": "recjQKD6kupvQez7x",
      "name": "Ethan Ware, Esq.",
      "firstName": "Ethan",
      "title": "Partner at Williams Mullen",
      "organization": "Wymer Employment Law",
      "bio": "Ethan Ware is chair of the Environment and Natural Resources Group at Williams Mullen, representing clients nationwide in complex environmental matters. Based in Columbia, South Carolina, he defends companies in class actions, enforcement actions, permit appeals, administrative investigations, and cost recovery cases at both state and federal levels.\n\nEthan has extensive experience advising mining, manufacturing, and distribution clients on EPA and state regulations involving hazardous waste, emissions, pesticides, asbestos, PCBs, and more. He regularly handles cases under the Clean Water Act, Clean Air Act, RCRA, CERCLA, TSCA, and related laws, including criminal investigations and prosecutions.\n\nRecognized by Chambers USA and Best Lawyers in America® for environmental law and litigation, Ethan has twice been named Best Lawyers® “Lawyer of the Year” in Columbia. With a background in biology, he brings both scientific insight and legal acumen to every matter, earning a national reputation as a leading environmental attorney.",
      "imageUrl": "",
      "bioLink": "www.iaml.com"
    },
    {
      "id": "recrHAK0n4YDIMthb",
      "name": "Ray Deeny, Esq.",
      "firstName": "Ray",
      "title": "Partner",
      "organization": "Taft Stettinius & Hollister LLP",
      "bio": "",
      "imageUrl": "https://storage.googleapis.com/msgsndr/MjGEy0pobNT9su2YJqFI/media/690667eb6947d86fd7edcc6f.svg",
      "bioLink": "www.iaml.com"
    },
    {
      "id": "rectoEby18SQxEqmO",
      "name": "Cyndi Ramirez Ryan",
      "firstName": "Cyndi",
      "title": "Founder & Chief Executive Officer",
      "organization": "Más Talent HR",
      "bio": "Cyndi Ramirez Ryan, MBA, SPHR is a veteran HR and diversity executive with 20+ years of experience driving organizational change, talent management, leadership development, executive coaching, and D&I initiatives. She is the Founder & Principal Consultant of Más Talent, a nationwide HR consulting firm based in Dallas/Fort Worth, where she helps companies align people strategies with business goals.\n\nCyndi previously held executive HR and D&I roles with Baylor Scott & White Healthcare, Philips Medical, and GEICO Direct Insurance, specializing in HR delivery models, M&A integrations, succession planning, and talent strategy. Named one of Texas’ Most Powerful & Influential Women by the Texas Diversity Council, she is also an executive coach, Hogan-certified consultant, and advisor to SMU’s Latino Leadership Initiative.\n\nAs President of The Joey Ryan Foundation, she honors her son’s legacy by advancing disability awareness and empowerment. Fully bilingual, Cyndi integrates her Mexican and Native American heritage into her work, helping organizations meet the needs of today’s diverse workforce.",
      "imageUrl": "https://storage.googleapis.com/msgsndr/MjGEy0pobNT9su2YJqFI/media/6911f33aeb42483a1e806109.svg",
      "bioLink": "www.iaml.com"
    },
    {
      "id": "recu2bleWSmRJTwoa",
      "name": "Ashley Gillihan, Esq.",
      "firstName": "Ashley",
      "title": "Partner",
      "organization": "Alston & Bird LLP",
      "bio": "",
      "imageUrl": "https://storage.googleapis.com/msgsndr/MjGEy0pobNT9su2YJqFI/media/690667ebd086b239c1e18e30.svg",
      "bioLink": "www.iaml.com"
    }
  ]
}